In [5]:
import numpy as np
import pandas as pd

In [6]:
# Series

In [7]:
grades={"Atil":40, "Bilge":90, "Lars":30}

In [8]:
pd.Series(grades)

Atil     40
Bilge    90
Lars     30
dtype: int64

In [9]:
names=["Atil","Bilge","Lars"]
grades=[40,90,30]
pd.Series(names)

0     Atil
1    Bilge
2     Lars
dtype: object

In [10]:
pd.Series(grades)

0    40
1    90
2    30
dtype: int64

In [11]:
pd.Series(grades,names)

Atil     40
Bilge    90
Lars     30
dtype: int64

In [12]:
pd.Series(names,grades)

40     Atil
90    Bilge
30     Lars
dtype: object

In [13]:
pd.Series( data=grades,index=names)

Atil     40
Bilge    90
Lars     30
dtype: int64

In [14]:
#with numpy

In [15]:
numpy_array=np.array([50,40,30,20])

In [16]:
pd.Series(numpy_array)

0    50
1    40
2    30
3    20
dtype: int64

In [17]:
#aritmethic

In [18]:
result=pd.Series(data=[10,5,100], index=["Atil","Bilge","Lars"])

In [19]:
result2=pd.Series(data=[20,50,10], index=["Atil","Bilge","Lars"])

In [20]:
result

Atil      10
Bilge      5
Lars     100
dtype: int64

In [21]:
result2

Atil     20
Bilge    50
Lars     10
dtype: int64

In [22]:
final=result+result2
final

Atil      30
Bilge     55
Lars     110
dtype: int64

In [23]:
series1=pd.Series([20,30,40,50],["a","b","c","d"])
series2=pd.Series([10,5,3,1],["a","c","f","g"])

series1+series2

a    30.0
b     NaN
c    45.0
d     NaN
f     NaN
g     NaN
dtype: float64

In [24]:
# Dataframe

In [25]:
data=np.random.randn(4,3)
data

array([[ 0.98236746, -1.67189884,  0.20749687],
       [-0.7248522 ,  1.51707186,  1.94950382],
       [ 1.33632312,  0.51400247,  0.59741126],
       [ 0.036212  ,  0.32646632,  1.48481475]])

In [26]:
data_frame=pd.DataFrame(data)
data_frame

          0         1         2
0  0.982367 -1.671899  0.207497
1 -0.724852  1.517072  1.949504
2  1.336323  0.514002  0.597411
3  0.036212  0.326466  1.484815

In [27]:
 type(data_frame)

pandas.core.frame.DataFrame

In [28]:
data_frame[0]

0    0.982367
1   -0.724852
2    1.336323
3    0.036212
Name: 0, dtype: float64

In [29]:
type(data_frame[0])

pandas.core.series.Series

In [30]:
new_df=pd.DataFrame(data,index=["bilge","zumra","hatice","akın"],columns=["salary","age","seniority"])
new_df

          salary       age  seniority
bilge   0.982367 -1.671899   0.207497
zumra  -0.724852  1.517072   1.949504
hatice  1.336323  0.514002   0.597411
akın    0.036212  0.326466   1.484815

In [31]:
new_df["age"]

bilge    -1.671899
zumra     1.517072
hatice    0.514002
akın      0.326466
Name: age, dtype: float64

In [32]:
new_df[["age","salary"]]

             age    salary
bilge  -1.671899  0.982367
zumra   1.517072 -0.724852
hatice  0.514002  1.336323
akın    0.326466  0.036212

In [33]:
new_df.loc["bilge"] #rowdan getirmek için

salary       0.982367
age         -1.671899
seniority    0.207497
Name: bilge, dtype: float64

In [34]:
new_df.iloc[0] # 0. rowdakini getir

salary       0.982367
age         -1.671899
seniority    0.207497
Name: bilge, dtype: float64

In [35]:
new_df.iloc[:,1] #:  tüm satırlar için  1. kolonu al

bilge    -1.671899
zumra     1.517072
hatice    0.514002
akın      0.326466
Name: age, dtype: float64

In [36]:
#data manipulation

In [37]:
new_df["extra"]=10

In [38]:
new_df

          salary       age  seniority  extra
bilge   0.982367 -1.671899   0.207497     10
zumra  -0.724852  1.517072   1.949504     10
hatice  1.336323  0.514002   0.597411     10
akın    0.036212  0.326466   1.484815     10

In [39]:
new_df.drop("extra", axis=1, inplace=True) 
# extra sutununu sil 
#( axis:1 sutun demek axis:0 satır demek)
# inplace: dataframe'in kendisinde de değiştir

In [40]:
new_df.loc["zumra"]

salary      -0.724852
age          1.517072
seniority    1.949504
Name: zumra, dtype: float64

In [41]:
new_df.loc["zumra"]["salary"]

-0.7248522004163807

In [42]:
new_df.loc["zumra","salary"]

-0.7248522004163807

In [43]:
new_df.loc["zumra","salary"]=100
new_df

            salary       age  seniority
bilge     0.982367 -1.671899   0.207497
zumra   100.000000  1.517072   1.949504
hatice    1.336323  0.514002   0.597411
akın      0.036212  0.326466   1.484815

In [44]:
bool_frame=new_df >0
bool_frame

        salary    age  seniority
bilge     True  False       True
zumra     True   True       True
hatice    True   True       True
akın      True   True       True

In [45]:
new_df[new_df>0]

            salary       age  seniority
bilge     0.982367       NaN   0.207497
zumra   100.000000  1.517072   1.949504
hatice    1.336323  0.514002   0.597411
akın      0.036212  0.326466   1.484815

In [46]:
new_df[new_df["age"]>0]

            salary       age  seniority
zumra   100.000000  1.517072   1.949504
hatice    1.336323  0.514002   0.597411
akın      0.036212  0.326466   1.484815

In [47]:
#index

In [48]:
 reset_frame=new_df.reset_index()
reset_frame

    index      salary       age  seniority
0   bilge    0.982367 -1.671899   0.207497
1   zumra  100.000000  1.517072   1.949504
2  hatice    1.336323  0.514002   0.597411
3    akın    0.036212  0.326466   1.484815

In [49]:
reset_frame.loc[0]

index           bilge
salary       0.982367
age         -1.671899
seniority    0.207497
Name: 0, dtype: object

In [50]:
new_indices=["ati","zey","bil","meh"]
new_df["NewIndex"]=new_indices
new_df

            salary       age  seniority NewIndex
bilge     0.982367 -1.671899   0.207497      ati
zumra   100.000000  1.517072   1.949504      zey
hatice    1.336323  0.514002   0.597411      bil
akın      0.036212  0.326466   1.484815      meh

In [51]:
new_df.set_index("NewIndex",inplace=True)
new_df

              salary       age  seniority
NewIndex
ati         0.982367 -1.671899   0.207497
zey       100.000000  1.517072   1.949504
bil         1.336323  0.514002   0.597411
meh         0.036212  0.326466   1.484815

In [52]:
new_df.loc["ati"]

salary       0.982367
age         -1.671899
seniority    0.207497
Name: ati, dtype: float64

In [53]:
#multi index

In [54]:
first_index=["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [55]:
inner_index=["Homer","bart","marge","cartman","kenny","kyle"]

In [56]:
zipped_index=list(zip(first_index,inner_index))
zipped_index

[('Simpson', 'Homer'),
 ('Simpson', 'bart'),
 ('Simpson', 'marge'),
 ('South Park', 'cartman'),
 ('South Park', 'kenny'),
 ('South Park', 'kyle')]

In [57]:
zipped_index=pd.MultiIndex.from_tuples(zipped_index)
zipped_index

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'bart'),
            (   'Simpson',   'marge'),
            ('South Park', 'cartman'),
            ('South Park',   'kenny'),
            ('South Park',    'kyle')],
           )

In [58]:
values=np.ones((6,2))

In [59]:
big_df=pd.DataFrame(values,index=zipped_index,columns=["age","salary"])
big_df

                    age  salary
Simpson    Homer    1.0     1.0
           bart     1.0     1.0
           marge    1.0     1.0
South Park cartman  1.0     1.0
           kenny    1.0     1.0
           kyle     1.0     1.0

In [60]:
big_df.loc["Simpson"].loc["Homer"]

age       1.0
salary    1.0
Name: Homer, dtype: float64

In [61]:
big_df["age"]

Simpson     Homer      1.0
            bart       1.0
            marge      1.0
South Park  cartman    1.0
            kenny      1.0
            kyle       1.0
Name: age, dtype: float64

In [62]:
# groupby

In [66]:
df=pd.read_csv("6-employee.csv")
df

   Department Employee  Salary  Experience           City
0   Marketing    Emp_1   53483           1       New York
1       Sales    Emp_2   78555           8         Austin
2     Finance    Emp_3   47159           3         Austin
3       Sales    Emp_4  110077           3  San Francisco
4       Sales    Emp_5   65920           1       New York
5          IT    Emp_6   97121          11        Chicago
6     Finance    Emp_7   99479           5        Chicago
7     Finance    Emp_8  119475          10       New York
8     Finance    Emp_9   49457           7        Chicago
9       Sales   Emp_10   96557          10        Chicago
10  Marketing   Emp_11  107189           9       New York
11    Finance   Emp_12  108953          12         Austin
12      Sales   Emp_13   82995           7       New York
13         IT   Emp_14   70757           9         Austin
14  Marketing   Emp_15   39692           8        Chicago
15         IT   Emp_16   75758          12        Chicago
16  Marketing   Emp_17  102409           2        Chicago
17      Sales   Emp_18  101211           1  San Francisco
18         HR   Emp_19   95697           7         Austin
19  Marketing   Emp_20   67065           7  San Francisco
20         IT   Emp_21   62606          14  San Francisco
21      Sales   Emp_22   41534           8       New York
22  Marketing   Emp_23   70397           5  San Francisco
23         HR   Emp_24   31016           3       New York
24         HR   Emp_25  119789          12       New York
25    Finance   Emp_26   85591           8  San Francisco
26    Finance   Emp_27  119812           6         Austin
27         IT   Emp_28   53247          11         Austin
28  Marketing   Emp_29   54300           3         Austin
29  Marketing   Emp_30  104065           1         Austin
30    Finance   Emp_31  112798           3         Austin
31  Marketing   Emp_32   39268           5  San Francisco
32  Marketing   Emp_33  116807          14  San Francisco
33         HR   Emp_34   42185           3        Chicago
34    Finance   Emp_35   93704           1         Austin
35      Sales   Emp_36  116779           5  San Francisco
36    Finance   Emp_37   69099          10        Chicago
37      Sales   Emp_38   38571           7         Austin
38         HR   Emp_39   68044          14       New York
39         IT   Emp_40   81214           7        Chicago
40  Marketing   Emp_41   91228          11  San Francisco
41         HR   Emp_42   78984           9       New York
42  Marketing   Emp_43   70774          10       New York
43         IT   Emp_44   32568          10       New York
44         IT   Emp_45   92592          12        Chicago
45         HR   Emp_46   97563          13  San Francisco
46         IT   Emp_47   32695           3       New York
47      Sales   Emp_48   78190           7         Austin
48         IT   Emp_49   35258           1       New York
49  Marketing   Emp_50  117538           4       New York

In [67]:
df.describe()

              Salary  Experience
count      50.000000   50.000000
mean    78344.500000    7.060000
std     27817.603904    3.966235
min     31016.000000    1.000000
25%     53687.250000    3.000000
50%     78769.500000    7.000000
75%    100778.000000   10.000000
max    119812.000000   14.000000

In [71]:
df["Salary"].mean()

78344.5

In [70]:
df[["Salary","Experience"]].mean()

Salary        78344.50
Experience        7.06
dtype: float64

In [72]:
df.count()

Department    50
Employee      50
Salary        50
Experience    50
City          50
dtype: int64

In [78]:
 df[df["Experience"]>6].count() #tecrubesi 6 yıldan fazla olan 30 kişi var.

Department    30
Employee      30
Salary        30
Experience    30
City          30
dtype: int64

In [85]:
df_grouped=df.groupby("Department") # departmanlara göre grupla
df_grouped.count()

            Employee  Salary  Experience  City
Department
Finance           10      10          10    10
HR                 7       7           7     7
IT                10      10          10    10
Marketing         13      13          13    13
Sales             10      10          10    10

In [86]:
df_grouped.describe()

           Salary                                                          \
            count          mean           std      min       25%      50%
Department
Finance      10.0  90552.700000  27228.231832  47159.0  73222.00  96591.5
HR            7.0  76182.571429  31647.523983  31016.0  55114.50  78984.0
IT           10.0  63381.600000  24272.881041  32568.0  39755.25  66681.5
Marketing    13.0  79555.000000  28431.207129  39268.0  54300.00  70774.0
Sales        10.0  81038.900000  26623.181534  38571.0  68987.50  80775.0

                                Experience                                \
                  75%       max      count      mean       std  min  25%
Department
Finance     111836.75  119812.0       10.0  6.500000  3.566822  1.0  3.5
HR           96630.00  119789.0        7.0  8.714286  4.572173  3.0  5.0
IT           79850.00   97121.0       10.0  9.000000  4.163332  1.0  7.5
Marketing   104065.00  117538.0       13.0  6.153846  4.079341  1.0  3.0
Sales       100047.50  116779.0       10.0  5.700000  3.093003  1.0  3.5


             50%    75%   max
Department
Finance      6.5   9.50  12.0
HR           9.0  12.50  14.0
IT          10.5  11.75  14.0
Marketing    5.0   9.00  14.0
Sales        7.0   7.75  10.0

In [87]:
df_grouped["Salary"].mean()

Department
Finance      90552.700000
HR           76182.571429
IT           63381.600000
Marketing    79555.000000
Sales        81038.900000
Name: Salary, dtype: float64

In [88]:
df_city=df.groupby("City") #sehirlere göre grupla

In [94]:
df_city["Salary"].mean() # o şehrin ortalama maaşı

City
Austin           81216.000000
Chicago          76869.363636
New York         70484.133333
San Francisco    87144.727273
Name: Salary, dtype: float64